nexty-india/AirCon-/board/pin_mux.h
#define PCR_IBE_ibe0 0x00u          /*!<@brief Input Buffer Enable: Disables */
#define PORT2_PCR19_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR5_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT2_PCR6_MUX_mux00 0x00u  /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */

/*! @name PORT2_5 (number 19), F_IPMT
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_F_IPMT_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_F_IPMT_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_F_IPMT_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT2_19 (number 27), FAN_IW
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_FAN_IW_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_FAN_IW_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_FAN_IW_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT2_19 (number 27), FAN_IW
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_OPAMP1_OUT_PORT PORT2                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_OPAMP1_OUT_PIN 19U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_OPAMP1_OUT_PIN_MASK (1U << 19U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PORT2_6 (number 20), FAN_IV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_FAN_IV_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_FAN_IV_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_FAN_IV_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT2_6 (number 20), FAN_IV
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_OPAMP2_OUT_PORT PORT2               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_OPAMP2_OUT_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_OPAMP2_OUT_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                               /* @} */

/*! @name PORT1_10 (number 4), UDCB
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_UDCB_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_UDCB_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_UDCB_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name PORT1_11 (number 5), PFC_I
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_PFC_I_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_PFC_I_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_PFC_I_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*! @name PORT1_12 (number 6), VAC
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITADC1PINS_VAC_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITADC1PINS_VAC_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITADC1PINS_VAC_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitADC1Pins(void);

#define PCR_IBE_ibe1 0x01u /*!<@brief Input Buffer Enable: Enables */

/*! @name PORT1_13 (number 7), RLY_IN
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITGPIOPINS_RLY_IN_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGPIOPINS_RLY_IN_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITGPIOPINS_RLY_IN_GPIO_PIN 13U              /*!<@brief GPIO pin number */
#define BOARD_INITGPIOPINS_RLY_IN_GPIO_PIN_MASK (1U << 13U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITGPIOPINS_RLY_IN_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGPIOPINS_RLY_IN_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITGPIOPINS_RLY_IN_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_7 (number 43), WV4
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITGPIOPINS_WV4_GPIO GPIO3               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGPIOPINS_WV4_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITGPIOPINS_WV4_GPIO_PIN 7U              /*!<@brief GPIO pin number */
#define BOARD_INITGPIOPINS_WV4_GPIO_PIN_MASK (1U << 7U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITGPIOPINS_WV4_PORT PORT3               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGPIOPINS_WV4_PIN 7U                   /*!<@brief PORT pin number */
#define BOARD_INITGPIOPINS_WV4_PIN_MASK (1U << 7U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name PORT1_30 (number 9), EVALVE0
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITGPIOPINS_EVALVE0_GPIO GPIO1                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGPIOPINS_EVALVE0_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITGPIOPINS_EVALVE0_GPIO_PIN 30U              /*!<@brief GPIO pin number */
#define BOARD_INITGPIOPINS_EVALVE0_GPIO_PIN_MASK (1U << 30U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITGPIOPINS_EVALVE0_PORT PORT1                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGPIOPINS_EVALVE0_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_INITGPIOPINS_EVALVE0_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*! @name PORT1_5 (number 63), EVALVE1
  @{ */

