nexty-india/AirCon-/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITGPIOPINS_EVALVE1_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGPIOPINS_EVALVE1_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITGPIOPINS_EVALVE1_GPIO_PIN 5U              /*!<@brief GPIO pin number */
#define BOARD_INITGPIOPINS_EVALVE1_GPIO_PIN_MASK (1U << 5U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITGPIOPINS_EVALVE1_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGPIOPINS_EVALVE1_PIN 5U                   /*!<@brief PORT pin number */
#define BOARD_INITGPIOPINS_EVALVE1_PIN_MASK (1U << 5U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT1_6 (number 64), EVALVE2
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITGPIOPINS_EVALVE2_GPIO GPIO1               /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGPIOPINS_EVALVE2_INIT_GPIO_VALUE 0U       /*!<@brief GPIO output initial state */
#define BOARD_INITGPIOPINS_EVALVE2_GPIO_PIN 6U              /*!<@brief GPIO pin number */
#define BOARD_INITGPIOPINS_EVALVE2_GPIO_PIN_MASK (1U << 6U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITGPIOPINS_EVALVE2_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGPIOPINS_EVALVE2_PIN 6U                   /*!<@brief PORT pin number */
#define BOARD_INITGPIOPINS_EVALVE2_PIN_MASK (1U << 6U)      /*!<@brief PORT pin mask */
                                                            /* @} */

/*! @name PORT3_28 (number 33), EVALVE3
  @{ */

/* Symbols to be used with GPIO driver */
#define BOARD_INITGPIOPINS_EVALVE3_GPIO GPIO3                /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITGPIOPINS_EVALVE3_INIT_GPIO_VALUE 0U        /*!<@brief GPIO output initial state */
#define BOARD_INITGPIOPINS_EVALVE3_GPIO_PIN 28U              /*!<@brief GPIO pin number */
#define BOARD_INITGPIOPINS_EVALVE3_GPIO_PIN_MASK (1U << 28U) /*!<@brief GPIO pin mask */

/* Symbols to be used with PORT driver */
#define BOARD_INITGPIOPINS_EVALVE3_PORT PORT3                /*!<@brief PORT peripheral base pointer */
#define BOARD_INITGPIOPINS_EVALVE3_PIN 28U                   /*!<@brief PORT pin number */
#define BOARD_INITGPIOPINS_EVALVE3_PIN_MASK (1U << 28U)      /*!<@brief PORT pin mask */
                                                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitGPIOPins(void);

#define PCR_IBE_ibe0 0x00u /*!<@brief Input Buffer Enable: Disables */

/*! @name PORT1_4 (number 62), PFC_OC
  @{ */

/* Symbols to be used with PORT driver */
#define BOARD_INITCMP0PINS_PFC_OC_PORT PORT1               /*!<@brief PORT peripheral base pointer */
#define BOARD_INITCMP0PINS_PFC_OC_PIN 4U                   /*!<@brief PORT pin number */
#define BOARD_INITCMP0PINS_PFC_OC_PIN_MASK (1U << 4U)      /*!<@brief PORT pin mask */
                                                           /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitCMP0Pins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
